# Curve Overlap Point Type Property

Source: https://www.revitapidocs.com/2026/5ba47968-7b11-bf11-f25f-fdf1e8c1a3c8.htm

---

| Curve Overlap Point Type Property |
| --- |

The type of overlap at the point.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public CurveOverlapPointType Type { get; }
```

```
Public ReadOnly Property Type As CurveOverlapPointType
	Get
```

```
public:
property CurveOverlapPointType Type {
	CurveOverlapPointType get ();
}
```

```
member Type : CurveOverlapPointType with get
```

#### Property Value

CurveOverlapPointType See Also

#### Reference

CurveOverlapPoint Class Autodesk.Revit.DB Namespace